profiling/stage_5/get_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 6.871ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 12.927ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 15.003ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10.481ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  432.94us  10.34ms   77.36%
    Req/Sec   618.05    261.08     1.55k    53.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.13ms
 75.000%    1.37ms
 90.000%    1.57ms
 99.000%    1.99ms
 99.900%    6.21ms
 99.990%    8.85ms
 99.999%   10.35ms
100.000%   10.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.412     0.000000            1         1.00
       0.661     0.100000         4394         1.11
       0.791     0.200000         8817         1.25
       0.908     0.300000        13171         1.43
       1.021     0.400000        17566         1.67
       1.126     0.500000        21975         2.00
       1.174     0.550000        24157         2.22
       1.223     0.600000        26349         2.50
       1.271     0.650000        28558         2.86
       1.318     0.700000        30711         3.33
       1.368     0.750000        32921         4.00
       1.395     0.775000        34025         4.44
       1.422     0.800000        35129         5.00
       1.451     0.825000        36226         5.71
       1.484     0.850000        37326         6.67
       1.521     0.875000        38411         8.00
       1.543     0.887500        38949         8.89
       1.567     0.900000        39500        10.00
       1.592     0.912500        40051        11.43
       1.620     0.925000        40586        13.33
       1.652     0.937500        41140        16.00
       1.669     0.943750        41417        17.78
       1.689     0.950000        41692        20.00
       1.709     0.956250        41959        22.86
       1.731     0.962500        42229        26.67
       1.762     0.968750        42511        32.00
       1.780     0.971875        42640        35.56
       1.796     0.975000        42780        40.00
       1.818     0.978125        42917        45.71
       1.843     0.981250        43050        53.33
       1.880     0.984375        43190        64.00
       1.902     0.985938        43256        71.11
       1.926     0.987500        43324        80.00
       1.962     0.989062        43393        91.43
       2.007     0.990625        43461       106.67
       2.065     0.992188        43530       128.00
       2.103     0.992969        43565       142.22
       2.161     0.993750        43598       160.00
       2.259     0.994531        43634       182.86
       2.465     0.995313        43667       213.33
       2.687     0.996094        43701       256.00
       2.933     0.996484        43718       284.44
       3.229     0.996875        43735       320.00
       3.565     0.997266        43753       365.71
       4.005     0.997656        43770       426.67
       4.351     0.998047        43788       512.00
       4.595     0.998242        43795       568.89
       5.007     0.998437        43804       640.00
       5.431     0.998633        43813       731.43
       5.823     0.998828        43821       853.33
       6.291     0.999023        43830      1024.00
       6.443     0.999121        43834      1137.78
       6.691     0.999219        43838      1280.00
       6.975     0.999316        43843      1462.86
       7.123     0.999414        43847      1706.67
       7.515     0.999512        43851      2048.00
       7.815     0.999561        43853      2275.56
       8.059     0.999609        43855      2560.00
       8.231     0.999658        43858      2925.71
       8.343     0.999707        43860      3413.33
       8.471     0.999756        43862      4096.00
       8.535     0.999780        43863      4551.11
       8.623     0.999805        43864      5120.00
       8.687     0.999829        43865      5851.43
       8.727     0.999854        43866      6826.67
       8.831     0.999878        43867      8192.00
       8.847     0.999890        43868      9102.22
       8.847     0.999902        43868     10240.00
       8.943     0.999915        43869     11702.86
       8.943     0.999927        43869     13653.33
       9.807     0.999939        43870     16384.00
       9.807     0.999945        43870     18204.44
       9.807     0.999951        43870     20480.00
       9.999     0.999957        43871     23405.71
       9.999     0.999963        43871     27306.67
       9.999     0.999969        43871     32768.00
       9.999     0.999973        43871     36408.89
       9.999     0.999976        43871     40960.00
      10.351     0.999979        43872     46811.43
      10.351     1.000000        43872          inf
#[Mean    =        1.134, StdDeviation   =        0.433]
#[Max     =       10.344, Total count    =        43872]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  73076 requests in 30.01s, 4.63MB read
  Socket errors: connect 7, read 0, write 0, timeout 13981
  Non-2xx or 3xx responses: 48
Requests/sec:   2435.24
Transfer/sec:    158.02KB