profiling/stage_5/put_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 11.056ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 28.409ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 7.666ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 13.518ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  425.60us  12.22ms   79.27%
    Req/Sec   643.52    218.19     1.50k    54.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.09ms
 75.000%    1.33ms
 90.000%    1.50ms
 99.000%    1.84ms
 99.900%    6.64ms
 99.990%    9.34ms
 99.999%   12.23ms
100.000%   12.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.416     0.000000            1         1.00
       0.639     0.100000         4585         1.11
       0.764     0.200000         9158         1.25
       0.874     0.300000        13712         1.43
       0.981     0.400000        18314         1.67
       1.086     0.500000        22882         2.00
       1.134     0.550000        25160         2.22
       1.184     0.600000        27446         2.50
       1.232     0.650000        29723         2.86
       1.281     0.700000        31995         3.33
       1.331     0.750000        34322         4.00
       1.354     0.775000        35442         4.44
       1.379     0.800000        36583         5.00
       1.405     0.825000        37722         5.71
       1.433     0.850000        38868         6.67
       1.462     0.875000        39994         8.00
       1.479     0.887500        40581         8.89
       1.497     0.900000        41155        10.00
       1.518     0.912500        41731        11.43
       1.540     0.925000        42279        13.33
       1.568     0.937500        42863        16.00
       1.583     0.943750        43137        17.78
       1.600     0.950000        43420        20.00
       1.620     0.956250        43707        22.86
       1.642     0.962500        44000        26.67
       1.663     0.968750        44278        32.00
       1.679     0.971875        44420        35.56
       1.694     0.975000        44558        40.00
       1.714     0.978125        44702        45.71
       1.739     0.981250        44848        53.33
       1.767     0.984375        44986        64.00
       1.784     0.985938        45060        71.11
       1.800     0.987500        45129        80.00
       1.819     0.989062        45201        91.43
       1.846     0.990625        45275       106.67
       1.885     0.992188        45346       128.00
       1.912     0.992969        45379       142.22
       1.947     0.993750        45415       160.00
       1.994     0.994531        45451       182.86
       2.085     0.995313        45486       213.33
       2.221     0.996094        45522       256.00
       2.315     0.996484        45540       284.44
       2.569     0.996875        45558       320.00
       3.029     0.997266        45576       365.71
       3.569     0.997656        45593       426.67
       4.143     0.998047        45611       512.00
       4.447     0.998242        45620       568.89
       5.247     0.998437        45629       640.00
       5.975     0.998633        45638       731.43
       6.279     0.998828        45647       853.33
       6.735     0.999023        45656      1024.00
       6.879     0.999121        45660      1137.78
       7.195     0.999219        45665      1280.00
       7.431     0.999316        45669      1462.86
       7.811     0.999414        45674      1706.67
       8.055     0.999512        45678      2048.00
       8.335     0.999561        45680      2275.56
       8.599     0.999609        45683      2560.00
       8.639     0.999658        45685      2925.71
       8.775     0.999707        45687      3413.33
       8.831     0.999756        45689      4096.00
       8.887     0.999780        45690      4551.11
       9.223     0.999805        45692      5120.00
       9.231     0.999829        45693      5851.43
       9.271     0.999854        45694      6826.67
       9.343     0.999878        45695      8192.00
       9.343     0.999890        45695      9102.22
       9.407     0.999902        45696     10240.00
       9.791     0.999915        45697     11702.86
       9.791     0.999927        45697     13653.33
       9.999     0.999939        45698     16384.00
       9.999     0.999945        45698     18204.44
       9.999     0.999951        45698     20480.00
      10.151     0.999957        45699     23405.71
      10.151     0.999963        45699     27306.67
      10.151     0.999969        45699     32768.00
      10.151     0.999973        45699     36408.89
      10.151     0.999976        45699     40960.00
      12.231     0.999979        45700     46811.43
      12.231     1.000000        45700          inf
#[Mean    =        1.093, StdDeviation   =        0.426]
#[Max     =       12.224, Total count    =        45700]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  75608 requests in 30.00s, 4.83MB read
  Socket errors: connect 7, read 0, write 0, timeout 13972
  Non-2xx or 3xx responses: 51
Requests/sec:   2520.23
Transfer/sec:    164.92KB