profiling/stage_5/range_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 12.021ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 29.383ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 33.899ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 27.688ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  602.75us  12.10ms   87.49%
    Req/Sec    61.70    115.26   777.00     87.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.51ms
 90.000%    1.77ms
 99.000%    2.45ms
 99.900%   10.52ms
 99.990%   12.10ms
 99.999%   12.10ms
100.000%   12.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.428     0.000000            1         1.00
       0.749     0.100000          438         1.11
       0.894     0.200000          878         1.25
       1.010     0.300000         1316         1.43
       1.116     0.400000         1754         1.67
       1.238     0.500000         2192         2.00
       1.290     0.550000         2416         2.22
       1.336     0.600000         2629         2.50
       1.394     0.650000         2850         2.86
       1.448     0.700000         3067         3.33
       1.507     0.750000         3286         4.00
       1.537     0.775000         3395         4.44
       1.571     0.800000         3506         5.00
       1.609     0.825000         3616         5.71
       1.657     0.850000         3723         6.67
       1.714     0.875000         3839         8.00
       1.742     0.887500         3888         8.89
       1.773     0.900000         3942        10.00
       1.813     0.912500         3997        11.43
       1.851     0.925000         4052        13.33
       1.919     0.937500         4107        16.00
       1.943     0.943750         4134        17.78
       1.972     0.950000         4161        20.00
       2.004     0.956250         4189        22.86
       2.043     0.962500         4216        26.67
       2.103     0.968750         4245        32.00
       2.127     0.971875         4257        35.56
       2.165     0.975000         4271        40.00
       2.211     0.978125         4286        45.71
       2.249     0.981250         4299        53.33
       2.285     0.984375         4312        64.00
       2.337     0.985938         4319        71.11
       2.365     0.987500         4326        80.00
       2.413     0.989062         4333        91.43
       2.465     0.990625         4339       106.67
       2.583     0.992188         4346       128.00
       2.637     0.992969         4350       142.22
       2.695     0.993750         4353       160.00
       2.731     0.994531         4357       182.86
       2.903     0.995313         4360       213.33
       3.733     0.996094         4363       256.00
       4.005     0.996484         4365       284.44
       6.567     0.996875         4367       320.00
       6.935     0.997266         4369       365.71
       6.987     0.997656         4370       426.67
       7.967     0.998047         4372       512.00
       8.695     0.998242         4373       568.89
       8.727     0.998437         4374       640.00
       9.407     0.998633         4375       731.43
       9.407     0.998828         4375       853.33
      10.519     0.999023         4376      1024.00
      10.863     0.999121         4377      1137.78
      10.863     0.999219         4377      1280.00
      10.887     0.999316         4378      1462.86
      10.887     0.999414         4378      1706.67
      10.887     0.999512         4378      2048.00
      11.351     0.999561         4379      2275.56
      11.351     0.999609         4379      2560.00
      11.351     0.999658         4379      2925.71
      11.351     0.999707         4379      3413.33
      11.351     0.999756         4379      4096.00
      12.103     0.999780         4380      4551.11
      12.103     1.000000         4380          inf
#[Mean    =        1.279, StdDeviation   =        0.603]
#[Max     =       12.096, Total count    =         4380]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7944 requests in 30.03s, 2.07MB read
  Socket errors: connect 7, read 0, write 0, timeout 13983
  Non-2xx or 3xx responses: 33
Requests/sec:    264.52
Transfer/sec:     70.44KB